{"from":"wordpress","title":"Emacs 24 でクリップボードとの連携が上手くいかなくなった","date":"2014-07-23T22:14:19.000Z","type":"notes","slug":"emacs24","html":"<p><a href=\"/notes/git-gutter\" title=\"Emacs: git-gutter が便利過ぎる\">というわけで</a> Emacs 24 に晴れてバージョンアップすることになった．</p>\n<pre><code>M-; emacs-version\n=> \"24.3.1\"\n</code></pre>\n<p>一応そんなに破壊的な変更は無いと見ていたし，実際ほとんど .emacs に変更は必要なかったが，X 周りは若干変わった点があったので注意が必要．</p>\n<!--more-->\n<p>自分で今までに気づいた変更はクリップボードとの連携がうまくいかなくなったこと．\n<a href=\"http://www.gnu.org/software/emacs/news/NEWS.24.1\">NEWS.24.1</a> に記述があって，従来の挙動に戻す方法も書いてあるのでそれに倣えば OK.</p>\n<blockquote>** Selection changes.\n<p>The default handling of clipboard and primary selections has been\nchanged to conform with modern X applications.  In short, most\ncommands for killing and yanking text now use the clipboard, while\nmouse commands use the primary selection.</p>\n<p>In the following, we provide a list of these changes, followed by a\nlist of steps to get the old behavior back if you prefer that.</p>\n<p>*** `select-active-regions’ now defaults to t.\nMerely selecting text (e.g. with drag-mouse-1) no longer puts it in\nthe kill ring.  The selected text is put in the primary selection, if\nthe system possesses a separate primary selection facility (e.g. X).</p>\n<p>**** <code>select-active-regions' also accepts a new value, </code>only’.\nThis means to only set the primary selection for temporarily active\nregions (usually made by mouse-dragging or shift-selection);\n“ordinary” active regions, such as those made with C-SPC followed by\npoint motion, do not alter the primary selection.</p>\n<p>**** `mouse-drag-copy-region’ now defaults to nil.</p>\n<p>*** mouse-2 is now bound to <code>mouse-yank-primary'. This pastes from the primary selection, ignoring the kill-ring. Previously, mouse-2 was bound to </code>mouse-yank-at-click’.</p>\n<p>*** `x-select-enable-clipboard’ now defaults to t on all platforms.</p>\n<p>*** `x-select-enable-primary’ now defaults to nil.\nThus, commands that kill text or copy it to the kill-ring (such as\nM-w, C-w, and C-k) also use the clipboard—not the primary selection.</p>\n<p>**** The “Copy”, “Cut”, and “Paste” items in the “Edit” menu are now\nexactly equivalent to M-w, C-w, and C-y respectively.</p>\n<p>**** Note that on MS-Windows, `x-select-enable-clipboard’ was already\nnon-nil by default, as Windows does not support the primary selection\nbetween applications.</p>\n<p>*** To return to the previous behavior, do the following:</p>\n<p>**** Change <code>select-active-regions' to nil. **** Change </code>mouse-drag-copy-region’ to t.\n**** Change <code>x-select-enable-primary' to t (on X only). **** Change </code>x-select-enable-clipboard’ to nil.\n**** Bind `mouse-yank-at-click’ to mouse-2.</blockquote></p>\n","headline":"というわけで Emacs 24 に晴れてバージョンアップすることになった．M-; emacs-version=> \"24.3.1\"一応そんなに破壊的な変更は無いと見ていたし，実際ほとんど .emacs"}