{"type":"data","nodes":[null,{"type":"data","data":[{"entity":1},{"name":2,"nameSegmented":3,"kind":14,"urlPath":15,"historyURL":16,"lastModified":17,"attributes":18,"tags":22,"body":26,"headline":27,"links":28,"isEmpty":52},"あまりに唐突に、お笑い芸人のかまいたちのことを何も知らなすぎることに気づいてびっくりした。",[4,5,6,7,8,9,10,11,12,13],"あまりに","唐突に、","お笑い","芸人のかまいたちの","ことを","何も","知らなすぎる","ことに","気づいて","びっくりした。","note","/notes/kamaitachi","https://github.com/kissge/yo.eki.do/commits/master/notes/kamaitachi.md",["Date","2024-02-02T15:03:37.000Z"],{"title":2,"date":19,"tags":20},["Date","2024-02-02T15:03:37.600Z"],[21],"エッセイ",[23],{"name":21,"kind":24,"urlPath":25},"tag","/mono/%E3%82%A8%E3%83%83%E3%82%BB%E3%82%A4","\u003Cp>あまりに唐突に、お笑い芸人のかまいたちのことを何も知らなすぎることに気づいてびっくりした。自分の無知に愕然としたという意味ではない。かまいたちって何者なんだ、という疑問のびっくりである。\u003C/p>\n\u003Cp>まず僕はテレビを見ない。というより、テレビが家に無い生活をかれこれ15年以上送っている。元々テレビを見る家庭の育ちでも無かった。学校でも職場でも長いこと情報系オタク文化圏のなかで過ごしているので、周りにテレビをよく見る人も多くない。とにかくテレビから距離が遠いところで生きている。\u003C/p>\n\u003Cp>それでも、テレビの知識は全くゼロにはならない。SNS、動画サイト、友人との会話、とにかく令和の日本で生きていてテレビに関する情報と一切接点を持たずに過ごすのは不可能だと思う。何なら僕は、幼少期から、そういう断片的な情報だけをもとに、あたかもテレビを見る人のように周りの話についていくという謎のスキルの高さには不毛な自負がある。\u003C/p>\n\u003Cp>だから、ネタ番組とか賞レースとかを見たことはなくても、たとえば千鳥とか、霜降り明星とか、チョコレートプラネットとか、そのくらいのメジャーな芸人さんたちだったら、顔とコンビ名くらいは一致するし、それどころか、芸風とか、決めフレーズとか、そのくらいの浅い知識はある。別に僕が能動的に知ろうとしたからではなく、普通に生きていたらみんなそうなっているだろう、と思うのだ。\u003C/p>\n\u003Cp>で、さっき、オフィスの戸締まりをしながら唐突に気付いたのだ。かまいたちのことを何も知らなすぎる。いや、顔は分かる。声も聞いたことある。千鳥とカラオケでバトルする番組をやっていることとか、生田絵梨花さんと紅白歌合戦に出ていたこととか、それも知っている。でも、芸風とか、決めフレーズとか、いわばお笑い芸人の本業の中身について、驚くほど全く何も知らない。え、何故なんだろう？\nあれだけのメジャーな芸人さんになって、この僕に（？）顔と名前を認知されるレベルなのに、でもそういう中身を認知されずにいるって、一体どんなスターダムの駆け上がり方をしてきたらそうなるんだろう？\n煽りとかじゃない。とにかく不思議なのである。\u003C/p>\n\u003Cp>特にオチはない。正解は、あるのかもしれない。誰か知っていたら教えてください。\u003C/p>\n","あまりに唐突に、お笑い芸人のかまいたちのことを何も知らなすぎることに気づいてびっくりした。自分の無知に愕然としたという意味ではない。かまいたちって何者なんだ、という疑問のびっくりである。まず僕はテレビを見ない。というより、テレビが家に無い生活をかれこれ15年以上送っている。元々テレビを見る家庭の育ちでも無かった。学校でも職場でも長いこと情報系オタク文化圏のなかで過ごしているので、周りにテレビをよく見る人も多くない。とにかくテレビから距離が遠いところで生きている。それでも、テレビの知識は全くゼロにはならない。SNS、動画サイト、友人との会話、とにかく令和の日本で生きていてテレビに関する情報と一切接点を持たずに過ごすのは不可能だと思う。何なら僕は、幼少期から、そういう断片的な情報だけをもとに、あたかもテレビを見る人のように周りの話についていくという謎のスキルの高さには不毛な自負がある。だから、ネタ番組とか賞レースとかを見たことはなくても、たとえば千鳥とか、霜降り明星とか、チョコレートプラネットとか、そのくらいのメジャーな芸人さんたちだったら、顔とコンビ名くらいは一致するし、それどころか、芸風とか、決めフレーズとか",{"to":29,"one_hop_エッセイ":35},{"urlPath":15,"entities":30},[31],{"name":21,"nameSegmented":32,"kind":24,"urlPath":25,"tags":33,"isEmpty":34},[21],[],true,{"urlPath":25,"entities":36},[37],{"name":38,"nameSegmented":39,"kind":14,"urlPath":44,"historyURL":45,"lastModified":46,"attributes":47,"tags":50,"isEmpty":52},"デザイナだけど色覚異常（色弱）と診断された",[40,41,42,43],"デザイナだけど","色覚異常","（色弱）と","診断された","/notes/color-blind","https://github.com/kissge/yo.eki.do/commits/master/notes/color-blind.md",["Date","2024-06-02T14:22:16.000Z"],{"title":38,"date":48,"tags":49},["Date","2024-06-01T16:18:00.000Z"],[21],[51],{"name":21,"kind":24,"urlPath":25},false],"uses":{"url":1}}]}
